# ConnectorManager Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..ConnectorManager Property
MEPSystem Class See Also
---
Connector manager of the system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConnectorManager ConnectorManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
```

Visual C++
---
```text
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
```

# Remarks
The connector manager includes connectors which are used to connect with terminal elements and base equipment.
# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace